{"class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 100], "sparse": false}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "units": 3136, "trainable": true}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.9, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"name": "reshape_1", "trainable": true, "target_shape": [7, 7, 64]}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"name": "dropout_5", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "interpolation": "nearest", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "output_padding": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_transpose_1", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 32, "data_format": "channels_last"}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "momentum": 0.9, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "interpolation": "nearest", "data_format": "channels_last"}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "output_padding": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_transpose_2", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 16, "data_format": "channels_last"}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "momentum": 0.9, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "output_padding": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_transpose_3", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 8, "data_format": "channels_last"}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "momentum": 0.9, "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_5", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 1, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["conv2d_5", 0, 0]]}}, {"class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 28, 28, 1], "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_1", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "trainable": true, "filters": 64, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_2", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "trainable": true, "filters": 128, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_3", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "trainable": true, "filters": 256, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_4", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 512, "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"name": "dropout_4", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}, "class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "units": 1, "trainable": true}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}