{"class_name": "Model", "config": {"layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 100], "sparse": false}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "units": 3136, "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.9, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [7, 7, 64]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_5", "rate": 0.4, "noise_shape": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "output_padding": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_transpose_1", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 32, "data_format": "channels_last"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.9, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "interpolation": "nearest"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "output_padding": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_transpose_2", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 16, "data_format": "channels_last"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.9, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "linear", "output_padding": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_transpose_3", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 8, "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.9, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_5", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "filters": 1, "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}], "name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["conv2d_5", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}